import { Avatar, Box, Text } from "@yamada-ui/react";
import React from "react";

export const DetailDisplay = () => {
  return (
    <Box padding={"40px 0"}>
      <Text>#タグ</Text>
      <Text variant="h4" lineHeight={"3rem"}>
        Title
      </Text>
      <Box></Box>
      <Box display={"flex"} gap={"5px"} alignItems={"center"}>
        <Avatar>A</Avatar>
        <Text>ユーザー名</Text>
      </Box>

      <Box margin={"40px 0"}>
        <Text>
          ああああああああああああああああああああああああああああああああああああああ
          ああああああああああああああああああああああああああああああああああああああ
          ああああああああああああああああああああああああああああああああああああああ
          ああああああああああああああああああああああああああああああああああああああ
          ああああああああああああああああああああああああああああああああああああああ
          ああああああああああああああああああああああああああああああああああああああ
          ああああああああああああああああああああああああああああああああああああああ
          ああああああああああああああああああああああああああああああああああああああ
          ああああああああああああああああああああああああああああああああああああああ
          ああああああああああああああああああああああああああああああああああああああ
          ああああああああああああああああああああああああああああああああああああああ
          ああああああああああああああああああああああああああああああああああああああ
          ああああああああああああああああああああああああああああああああああああああ
          ああああああああああああああああああああああああああああああああああああああ
          ああああああああああああああああああああああああああああああああああああああ
        </Text>
      </Box>
    </Box>
  );
};
