import { Avatar, Box, Typography } from "@mui/material";
import React from "react";

export const DetailDisplay = () => {
  return (
    <Box padding={"40px 0"}>
      <Typography>#タグ</Typography>
      <Typography variant="h4" lineHeight={"3rem"}>
        Title
      </Typography>
      <Box></Box>
      <Box display={"flex"} gap={"5px"} alignItems={"center"}>
        <Avatar>A</Avatar>
        <Typography>ユーザー名</Typography>
      </Box>

      <Box margin={"40px 0"}>
        <Typography>
          ああああああああああああああああああああああああああああああああああああああ
          ああああああああああああああああああああああああああああああああああああああ
          ああああああああああああああああああああああああああああああああああああああ
          ああああああああああああああああああああああああああああああああああああああ
          ああああああああああああああああああああああああああああああああああああああ
          ああああああああああああああああああああああああああああああああああああああ
          ああああああああああああああああああああああああああああああああああああああ
          ああああああああああああああああああああああああああああああああああああああ
          ああああああああああああああああああああああああああああああああああああああ
          ああああああああああああああああああああああああああああああああああああああ
          ああああああああああああああああああああああああああああああああああああああ
          ああああああああああああああああああああああああああああああああああああああ
          ああああああああああああああああああああああああああああああああああああああ
          ああああああああああああああああああああああああああああああああああああああ
          ああああああああああああああああああああああああああああああああああああああ
        </Typography>
      </Box>
    </Box>
  );
};
